Update README to standard format
